; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v6 - type_2 ?v2 - type_3)
 	      (pred_2 ?v5 - object ?v2 - type_3)
	      (pred_4 ?v6 - type_2 ?v8 - type_1)
	      (pred_1 ?v6 - type_2 ?v5 - object ?v8 - type_1))

   (:action op_2
       :parameters  (?v6 - type_2 ?v3 ?v7 - type_3)
       :precondition (and  (pred_3 ?v6 ?v3))
       :effect (and  (pred_3 ?v6 ?v7)
		     (not (pred_3 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_2 ?v1 - object ?v4 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v4) (pred_3 ?v6 ?v4) (pred_4 ?v6 ?v8))
       :effect (and (pred_1 ?v6 ?v1 ?v8)
		    (not (pred_2 ?v1 ?v4)) 
		    (not (pred_4 ?v6 ?v8))))

   (:action op_3
       :parameters (?v6 - type_2 ?v1 - object ?v4 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v6 ?v1 ?v8) (pred_3 ?v6 ?v4))
       :effect (and (pred_2 ?v1 ?v4)
		    (pred_4 ?v6 ?v8)
		    (not (pred_1 ?v6 ?v1 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_12 obj_06 - type_1
obj_05 obj_10 obj_02 obj_09 - type_3
obj_07 obj_08 obj_01 - type_2
obj_11 obj_03 obj_04 - object)
(:init
(pred_3 obj_12 obj_08)
(pred_4 obj_12 obj_05)
(pred_4 obj_12 obj_10)
(pred_3 obj_06 obj_07)
(pred_4 obj_06 obj_02)
(pred_4 obj_06 obj_09)
(pred_2 obj_11 obj_07)
(pred_2 obj_03 obj_07)
(pred_2 obj_04 obj_08)
)
(:goal
(and
(pred_2 obj_11 obj_07)
(pred_2 obj_03 obj_07)
(pred_2 obj_04 obj_01)
)
)

(:constraints
  (always (not (pred_3 obj_12 obj_01)))
)
)

; plan
1. (op_2 obj_06 obj_07 obj_08)
   deleted: (pred_3 obj_06 obj_07)
   added: (pred_3 obj_06 obj_08)
   goals met: 2 of 3
2. (op_1 obj_06 obj_04 obj_08 obj_09)
   deleted: (pred_2 obj_04 obj_08) (pred_4 obj_06 obj_09)
   added: (pred_1 obj_06 obj_04 obj_09)
   goals met: 2 of 3
3. (op_2 obj_06 obj_08 obj_01)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_01)
   goals met: 2 of 3
4. (op_3 obj_06 obj_04 obj_01 obj_09)
   deleted: (pred_1 obj_06 obj_04 obj_09)
   added: (pred_2 obj_04 obj_01) (pred_4 obj_06 obj_09)
   goals met: 3 of 3
